<template>
  <div style=" height:570px; width:980px" id="main">
    <el-row>
      <div class="el-header " id="windowHead" style="text-align: right">
        <el-button type="infer" size="mini"  icon="el-icon-minus" id="minusButton" @click="minus" circle></el-button>
        <el-button type="infer" size="mini"  icon="el-icon-rank" id="magnifyButton" @click="magnify" circle></el-button>
        <el-button type="danger" size="mini"  @click="closeChooser"  icon="el-icon-close" circle></el-button>
      </div>
    </el-row>
    <el-row>
      <el-col :span="24">
        <div class="el-container" >
          <el-row style="width: 100%">
            <el-col :span="15">
              <div class="mainContainer">
                <el-row><div class="dataContainer" id="dataContainer">
                  <h1 style="text-align: center">法律法规与值班制度</h1>
                  <h4 style="text-align: left" >以连云港市石梁河水库管理办法举例:</h4>
                  <h4 style="text-align: left;text-indent: 2em;line-height: 25px"> 第一条 为加强石梁河水库管理，确保水库安全，维护和修复水库生态环境，充分发挥水库防洪、灌溉、供水和生态等功能，根据《中华人民共和国水法》《江苏省河道管理条例》《江苏省水库管理条例》等有关法律、法规规定，结合实际，制定本办法。
                    第二条 石梁河水库（以下简称“水库”）的管理、保护、修复、开发和利用适用本办法。
                    第三条 水库管理遵循安全第一、生态优先、统筹协调、系统治理、合理利用、绿色发展的原则。
                    第四条 水库管理保护落实河长制，分级分段设立河长。各级河长负责开展河道巡查，协调、督促解决管理和保护中的问题。建立健全水利、交通运输、公安、自然资源和规划、农业农村、生态环境等部门联动综合治理长效机制和联合执法机制。
                    第五条 市水行政主管部门负责水库的统筹协调和监督管理工作，具体履行下列职责：
                    （一）会同有关部门编制水库开发利用和保护等规划，依法履行相关程序后实施；
                    （二）监督、指导水库的管理和保护；
                    （三）协调有关部门和单位做好水库的管理和保护；
                    （四）依法实施水库水行政审批事项；
                    （五）监督指导水库管理机构做好水库的日常管理和安全维护工作；
                    （六）组织编制水库大坝安全管理应急预案，报市政府批准后组织实施；
                    （七）组织编制水库调度规程或者调度方案，报省水行政主管部门批准后实施；
                    （八）组织水库大坝安全鉴定工作；
                    （九）负责水行政执法工作，依法监督检查各类水事活动、查处涉水违法事件；
                    （十）依法应当履行的其他职责。
                    第六条 市政府各相关职能部门履行下列水库管理职责，实现齐抓共管、系统治理：
                    市交通运输部门负责水库水上交通安全和船舶污染的监督管理。
                    市自然资源和规划部门负责配合编制水库管理与保护规划、采砂规划。
                    市公安部门负责水库管理范围内的治安管理工作。
                    市农业农村部门负责水库渔业资源的保护，并对养殖、捕捞等行为进行监督管理。
                    市生态环境部门负责水库生态环境的监督管理和保护工作。
                    市应急管理部门对库区安全生产工作实施综合监督管理。
                    市财政、市场监管、旅游、税务等部门按照各自职责做好水库管理的相关工作。
                    法律、法规、规章等对部门职责另有规定的，从其规定。
<!--                    第七条 水库沿线各县（区）、乡（镇）政府应当在职责范围内，做好以下工作：-->
<!--                    （一）向群众宣传水库管理相关法律、法规和政策；-->
<!--                    （二）组织、协助有关部门对本行政区域内影响水库生态环境的突发性水污染事件进行调查并采取措施，消除污染；-->
<!--                    （三）配合相关部门做好水库生态环境修复工作；-->
<!--                    （四）配合查处水事违法行为和调处水事纠纷；-->
<!--                    （五）依法应当履行的其他职责。-->
<!--                    第八条 水库的日常管理和安全维护工作由石梁河水库管理机构（以下简称“水库管理机构”）负责，履行以下职责：-->
<!--                    （一）宣传、贯彻、执行有关水库管理的法律、法规、规章以及政策措施；-->
<!--                    （二）负责水库管理范围内工程设施的管理、维修、养护，具体落实水库生态环境修复，制订工程调度运用计划，执行调度指令，保证工程设施正常运行；-->
<!--                    （三）对水库管理范围内的开发利用活动实施监督管理；-->
<!--                    （四）制止侵占、毁损水库工程及其设施的行为；-->
<!--                    （五）配合有关部门做好水库管理相关工作；-->
<!--                    （六）依法应当履行的其他职责。-->
<!--                    第九条 县（区）政府应当加强水库集水区域环境保护基础设施建设，逐步扩大集水区域截污管网覆盖面，实现雨水、污水分流，配备生活污水、垃圾收集设施，并进行集中处理。-->
<!--                    第十条 任何单位和个人都有保护水库的义务，对破坏水库设施、影响水库安全的行为有权进行劝阻、举报。-->
<!--                    市政府或市有关部门对在水库管理和保护工作中做出突出成绩的单位和个人，给予表彰和奖励。-->
<!--                    第十一条 水库管理范围为：-->
<!--                    （一）主坝、副坝及其两端二百米、背水坡坝脚外二百米，二十七点九五米（废黄河高程基准，下同）等高线以下的库区；-->
<!--                    （二）水库南、北泄洪闸：下游河道和堤防各一千米；-->
<!--                    （三）北干渠闸：闸上游引河河道、闸下游河道二百米，左右侧河口向外各三十米。-->
<!--                    水库管理范围内的土地为水利工程管理用地。水库管理机构应当依法申请办理水库管理范围和管理设施用地手续，领取不动产权证书。水库的确权发证按照国家有关规定执行，不得损害公民、法人或者其他组织的合法权益。-->
<!--                    第十二条 在水库管理范围内，任何单位和个人均应当遵守以下规定：-->
<!--                    （一）禁止圈圩、打坝、围垦；-->
<!--                    （二）禁止建设宾馆、饭店、酒店、度假村、疗养院或者进行房地产开发；-->
<!--                    （三）禁止倾倒垃圾、废渣、农药，排放油类、酸液、碱液、剧毒废液；-->
<!--                    （四）禁止炸鱼、毒鱼、电鱼；-->
<!--                    （五）禁止擅自在水库水域内游泳、游玩、垂钓；-->
<!--                    （六）禁止损坏涵闸、水电站等各类建筑物及机电设备、水文、通讯、供电、观测等设施；-->
<!--                    （七）禁止在泄洪闸等安全警戒区内从事渔业养殖、捕（钓）鱼、停泊船舶、建设水上设施；-->
<!--                    （八）禁止设置除城镇污水集中处理设施以外的其他排污口；-->
<!--                    （九）禁止设置废物回收场、有毒有害物品仓库、堆栈或者垃圾填埋场；-->
<!--                    （十）禁止设置高尔夫球场或者从事水上餐饮经营；-->
<!--                    （十一）禁止设置畜禽养殖场；-->
<!--                    （十二）禁止设置剧毒物质或者危险化学品贮存、运输设施；-->
<!--                    （十三）法律、法规、规章等禁止的其他行为。-->
<!--                    在水库大坝管理和保护范围内，不得从事爆破、打井、采砂（包括取土、采石，下同）、采矿、挖掘、修坟等危害水库安全的活动。-->
<!--                    在入库河道、出库口门、溢洪河道内，不得设置行水障碍物。-->
<!--                    第十三条 在水库主坝、副坝坝体上，禁止下列行为：-->
<!--                    （一）侵占或者损坏大坝及其通讯、照明、遥测、安全监测等设施；-->
<!--                    （二）移动、破坏、损坏护坡石；-->
<!--                    （三）种植高大乔木及其他农作物；-->
<!--                    （四）打场晒粮、堆放杂物及放牧；-->
<!--                    （五）修建码头；-->
<!--                    （六）其他影响大坝正常使用及危害大坝安全的行为。-->
<!--                    第十四条 水库防汛抗旱实行各级政府行政首长负责制，统一指挥，分级分部门负责。-->
<!--                    第十五条 市水行政主管部门应当根据水库水量情况，确定水量使用分配方案。水库蓄水严重不足时，应当采取措施限制供水，并向水库补水。-->
<!--                    第十六条 对阻碍水库行洪的障碍物，按照谁设障、谁清除的原则，由防汛指挥机构责令限期清除；逾期不清除的，由防汛指挥机构组织强行清除，所需费用由设障者承担。-->
<!--                    第十七条 在汛期，水库沿线各级政府、各有关部门和单位应当积极配合和支持水库管理机构工作，不得阻碍和影响防汛抢险、防汛清障。水库因汛情需要泄洪，市防汛指挥机构应当提前向下游县（区）防汛机构进行通报。-->
<!--                    第十八条 市水行政主管部门应当加强水库水情、雨情遥测、通讯等自动化设施的建设，不断提高水库管理信息化水平。-->
<!--                    第十九条 水库管理机构应当建立健全水库安全管理制度，按照有关技术标准，加强水库主坝、副坝、溢洪道、泄洪闸以及灌溉涵洞、电站等设施的安全监测、检测和巡查。发现危及水库安全的隐患，应当及时采取措施，并报告市水行政主管部门。对损坏的工程设施，应当及时进行维修、养护、加固或者更新。所需费用除上级给予的补助外，其余应当纳入市级财政预算。-->
<!--                    第二十条 水库泄洪闸、灌溉涵洞和相关设施的操作，应当由水库管理机构专职人员严格按照调度指令和操作规程进行。-->
<!--                    第二十一条 水库管理机构应当做好水库运行、监测资料及水文观测资料的收集、整编工作，按年度汇编、登记归档，按照规定报送水行政主管部门。-->
<!--                    第二十二条水库的保护利用实行统一规划制度。水库管理与保护规划应当符合流域、区域综合规划和防洪、水资源等专业规划，与国土空间规划等规划相衔接。-->
<!--                    在水库管理范围内从事保护利用活动，应当符合规划，服从防洪安全、水污染防治和水资源保护的总体要求。-->
<!--                    第二十三条 开展水利风景区建设，水库风景区建设纳入全市旅游发展规划。-->
<!--                    第二十四条 村镇建设不得占用水库管理范围内的土地、水域。对水库管理范围内现有的居民和房屋，由市水行政主管部门会同东海县政府、赣榆区政府对其规模进行控制。-->
<!--                    第二十五条 直接取用水库水资源的单位和个人，应当按照国务院《取水许可和水资源费征收管理条例》和《江苏省水资源管理条例》的规定办理取水许可，并依法缴纳相关费用。-->
<!--                    第二十六条 确需临时占用水库管理范围内土地、水域从事生产经营活动的，应当依法办理相关手续，并按规定向同级财政缴纳国有资源有偿使用费。-->
<!--                    第二十七条 市水行政主管部门应当会同市农业农村主管部门，按照水库管理与保护规划、水域滩涂养殖规划、水功能区划、水质保护目标、水库安全运行以及防洪等要求，在水库库区内明确用于水产养殖的水域。-->
<!--                    在库区内从事网箱养殖的，应当符合水库开发利用和保护规划等要求，具体办法由市农业农村、水行政等主管部门另行制定。-->
<!--                    承包水库水域从事水产养殖的，应当与水库管理机构签订协议取得水域使用权，实行有偿使用。协议应当明确水产养殖服从水库蓄洪、泄洪、抗旱调水和水质保护的要求，承包期限每次一般不超过三年。-->
<!--                    渔业船舶及其有关航行、作业安全的重要设备应当经渔业船舶检验机构检验，并依法进行船舶登记，取得相应证书。渔业船舶应当配备符合船舶及安全作业的职务船员与普通船员。-->
<!--                    第二十八条 水库采砂应当符合水库开发利用和保护等规划要求，并实行总量控制。根据水库管理与保护规划编制水库采砂规划，市水行政主管部门制定年度采砂计划及实施方案，对水库可采区的具体范围、年度采砂控制总量、采（运）砂船舶控制数量及开采作业方式、时限等作出具体规定。-->
<!--                    第二十九条 水库禁止采砂范围为：-->
<!--                    （一）主坝上游迎水坡坝脚一千五百米内，背水坡坝脚外一千米内；副坝迎水坡、背水坡坝脚外一千米内；-->
<!--                    （二）南辰防洪堤迎水坡堤脚五十米内；-->
<!--                    （三）南、北辰大桥上游五百米及下游二千米内；-->
<!--                    （四）幸福桥上游五百米及下游一千米内；-->
<!--                    （五）其他禁止采砂区域。-->
<!--                    主汛期、超过警戒水位期间应当确定为禁采期。-->
<!--                    第三十条水库采砂实行许可制度。经营者在水库管理范围内采砂的，应当经市水行政主管部门批准，并遵守生态环境保护、安全生产、防洪等法律法规规定。未经许可不得采砂。-->
<!--                    水行政主管部门会同相关部门依法设定禁采区和设立禁采期，禁止在水库禁采区和禁采期从事采砂活动。-->
<!--                    第三十一条 水行政主管部门颁发的采砂许可证有效期不得超过一个可采期。-->
<!--                    从事采（运）砂的船舶与人员，应当向交通运输部门申请办理相应证书。-->
<!--                    第三十二条 从事水库采砂活动的经营者应当按照许可的开采地点、范围、期限、作业方式、作业工具等事项进行采砂，并定期清除废弃物，落实环境保护、安全生产等措施，不得在禁采区、禁采期从事采砂活动，不得危害水工程安全和航运安全。-->
<!--                    第三十三条 水库管理有关部门可以根据水库的水情、工情、汛情以及环境保护、安全管理等需要，对水库管理范围内的船舶、机具等依法采取管控措施，并提前向社会公告。-->
<!--                    第三十四条 市水行政主管部门应当加强水库水量、水质监测，发现水质不达标的，应当及时报告市政府。市政府组织有关部门采取治理措施，保证水质安全。-->
<!--                    第三十五条 县（区）政府应当对水库集水区域内的产业结构进行优化调整，建设水源涵养林、水土保持林和生态保护带、隔离带，增强涵养水源功能，防治水土流失。-->
<!--                    市水行政主管部门应当按照水生态环境保护规划和水域保护专项规划制定水域生态修复实施方案，实施方案应当包含生态补偿内容，报市政府批准后组织实施。-->
<!--                    第三十六条 市水行政主管部门应当根据水功能区划确定的水库水质管理目标和自然净化能力，向市生态环境部门提出限制排污总量意见。市生态环境部门根据水库水环境功能达标情况，制定各类污染源、污染物减排计划，抄送市水行政主管部门，并依法实施排污许可证管理。-->
<!--                    第三十七条 单位和个人违反本办法规定，依照法律、法规、规章的有关规定予以处理。阻碍国家机关工作人员依法执行职务的，由公安部门依照《中华人民共和国治安管理处罚法》的规定予以处罚；构成犯罪的，依法追究刑事责任。-->
<!--                    第三十八条 有关主管部门及其工作人员不依照本办法规定履行职责的，由有权机关依法依规给予处分；涉嫌犯罪的，移交有权机关处理。-->
<!--                    第三十九条 市水利、自然资源和规划、交通运输、农业农村、生态环境等主管部门可以根据本办法制定具体实施细则。-->
<!--                    第四十条 本办法自2021年6月1日起施行。市政府2005年6月5日发布的《连云港市石梁河水库管理暂行办法》（连政发〔2005〕107号）同时废止。-->
                  </h4>


                </div></el-row>
              </div>
            </el-col>
            <el-col :span="8">
              <div class="tableContainer" style="width: 360px" id="tableContainer">
<!--                <RiverInfoTable style="height: 100%;width: 100%" id="infoTable" ref="RiverInfoTable"/>-->
              </div>
            </el-col>
          </el-row>

        </div>
      </el-col>
    </el-row>


  </div>
</template>

<script>
  import  "../assets/js/jquery.table2excel.min.js"
  import RiverInfoTable from "./waterInfoTable/RiverInfoTable";
  export default {
    name: "waterInfo",
    components:{
      RiverInfoTable
    },
    methods:{
      loadSTInfo:function(){
        this.axios.get("http://localhost:8083/waterInfo/RSVR/ST").then(
          response=>{
            console.log(response.data);
            this.searchParameter.options=response.data;
          }
        );
      },
      //初始Echarts
      initEcharts:function(){
        let _this=this;
        this.myChart=this.$echarts.init(document.getElementById("echartsContainer"));
        this.myChart.setOption(option);
      },

      //关闭窗口
      closeChooser:function () {
        this.$emit('closeChooser')
      },
      //销毁
      removeEchart:function () {
        this.myChart.dispose();
        this.myChart=null;
      },

      //放大
      magnify:function () {
        let main =document.getElementById("main");

        main.style.height="100%";
        main.style.width="100%";
        main.style.left='0px';
        main.style.top='0px';
        document.getElementById("echartsContainer").style.height='500px';
        this.myChart.resize();
        document.getElementById("tableContainer").style.height='650px';
        document.getElementById("tableContainer").style.width='500px';
        document.getElementById("minusButton").style.display='inline-block';
        document.getElementById("magnifyButton").style.display='none';

      },
      //缩小
      minus:function () {
        let main =document.getElementById("main");

        main.style.height="570px";
        main.style.width="980px";
        main.style.left='260px';
        main.style.top='100px';
        document.getElementById("echartsContainer").style.height='390px';
        this.myChart.resize();
        document.getElementById("tableContainer").style.height='525px';
        document.getElementById("tableContainer").style.width='350px';
        document.getElementById("minusButton").style.display='none';
        document.getElementById("magnifyButton").style.display='inline-block';
      }
    },
    mounted() {
      this.loadSTInfo();
      this.initEcharts();
      this.loadData();
      let _this =this;
      let main = document.getElementById("main");
      let dataContainer = document.getElementById("dataContainer");
      let head= document.getElementById("windowHead");
      dataContainer.onmousedown= function(event){

        _this.fndown(main,event,dataContainer);
      }
      head.onmousedown= function(event){

        _this.fndown(main,event,head);
      }

    }
  }
</script>

<style scoped>
  .dataContainer{
    padding-left: 10px;
    /*padding-top: 15px;*/
  }
  .dataContainer>*{
    margin: 5px;

  }
  #echartsContainer{
    margin-left: 20px;
    margin-top: 5px;

    height:390px;
  }
  .mainContainer{
    position: relative;
    width: 150%;
    height: 520px;
    display: inline-block;

  }
  .tableContainer{

    /*width: 270px;*/
    height: 525px;
    width: 100%;
    display: inline-block;
    margin-bottom:10px ;
    padding-left: 5px;
  }
  .left{
    position: absolute;
    right: 5px;
  }
  .buttonContainer{
    position: relative;
    margin-top: 5px;
  }
  .right{
    position: relative;
    right: 5px;
  }
  #minusButton{
    display: none;
  }

</style>
